spec/vcr_cassettes/CheckoutController/POST_create/sets_the_delivery_option.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/checkout/sessions
    body:
      encoding: UTF-8
      string: payment_method_types[0]=card&line_items[0][price_data][currency]=usd&line_items[0][price_data][product_data][name]=Mediocre+Concrete+Keyboard&line_items[0][price_data][unit_amount]=1638&line_items[0][quantity]=2&line_items[1][price_data][currency]=usd&line_items[1][price_data][product_data][name]=Standard+Delivery&line_items[1][price_data][unit_amount]=1000&line_items[1][quantity]=1&mode=payment&success_url=http%3A%2F%2Ftest.host%2Fcheckout%2Fsuccess&cancel_url=http%3A%2F%2Ftest.host%2Fcheckout%2Fcancel
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/13.3.1
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_SopvNILQXqY5cq","request_duration_ms":857}}'
      Idempotency-Key:
      - 895fe671-996c-434c-9a91-d7c0234872f2
      Stripe-Version:
      - 2024-12-18.acacia
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"13.3.1","lang":"ruby","lang_version":"3.3.5 p100 (2024-09-03)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 5.15.167.4-microsoft-standard-WSL2 (root@f9c826d3017f) (gcc (GCC)
        11.2.0, GNU ld (GNU Binutils) 2.37) #1 SMP Tue Nov 5 00:21:55 UTC 2024","hostname":"DESKTOP-E94K6GG"}'
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 26 Jan 2025 16:17:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2494'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, HEAD, PUT, PATCH, POST, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, Stripe-Should-Retry, X-Stripe-External-Auth-Required,
        X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Content-Security-Policy:
      - base-uri 'none'; default-src 'none'; form-action 'none'; frame-ancestors 'none';
        img-src 'self'; script-src 'self' 'report-sample'; style-src 'self'; upgrade-insecure-requests;
        report-uri https://q.stripe.com/csp-violation?q=VAsWFBp3TnScBIer_Y8bacoZuV3LFv3eI1geRsCpkCHHQxukXwOyRr9-PXIuPAVGCz3MnXVMiPFwwzt1
      Cross-Origin-Opener-Policy-Report-Only:
      - same-origin; report-to="coop"
      Idempotency-Key:
      - 895fe671-996c-434c-9a91-d7c0234872f2
      Original-Request:
      - req_k3epGi0f7CiOmB
      Report-To:
      - '{"group":"coop","max_age":8640,"endpoints":[{"url":"https://q.stripe.com/coop-report"}],"include_subdomains":true}'
      Reporting-Endpoints:
      - coop="https://q.stripe.com/coop-report"
      Request-Id:
      - req_k3epGi0f7CiOmB
      Stripe-Should-Retry:
      - 'false'
      Stripe-Version:
      - 2024-12-18.acacia
      Vary:
      - Origin
      X-Content-Type-Options:
      - nosniff
      X-Stripe-Priority-Routing-Enabled:
      - 'true'
      X-Stripe-Routing-Context-Priority-Tier:
      - api-testmode
      X-Wc:
      - AB
      Strict-Transport-Security:
      - max-age=63072000; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |-
        {
          "id": "cs_test_b1OPNanJI2RTnd9YMTw6nhN0LxN7YpY05zMFuiMx6s9rzNMjaUuBYBmmal",
          "object": "checkout.session",
          "adaptive_pricing": {
            "enabled": false
          },
          "after_expiration": null,
          "allow_promotion_codes": null,
          "amount_subtotal": 4276,
          "amount_total": 4276,
          "automatic_tax": {
            "enabled": false,
            "liability": null,
            "status": null
          },
          "billing_address_collection": null,
          "cancel_url": "http://test.host/checkout/cancel",
          "client_reference_id": null,
          "client_secret": null,
          "consent": null,
          "consent_collection": null,
          "created": 1737908255,
          "currency": "usd",
          "currency_conversion": null,
          "custom_fields": [],
          "custom_text": {
            "after_submit": null,
            "shipping_address": null,
            "submit": null,
            "terms_of_service_acceptance": null
          },
          "customer": null,
          "customer_creation": "if_required",
          "customer_details": null,
          "customer_email": null,
          "expires_at": 1737994655,
          "invoice": null,
          "invoice_creation": {
            "enabled": false,
            "invoice_data": {
              "account_tax_ids": null,
              "custom_fields": null,
              "description": null,
              "footer": null,
              "issuer": null,
              "metadata": {},
              "rendering_options": null
            }
          },
          "livemode": false,
          "locale": null,
          "metadata": {},
          "mode": "payment",
          "payment_intent": null,
          "payment_link": null,
          "payment_method_collection": "if_required",
          "payment_method_configuration_details": null,
          "payment_method_options": {
            "card": {
              "request_three_d_secure": "automatic"
            }
          },
          "payment_method_types": [
            "card"
          ],
          "payment_status": "unpaid",
          "phone_number_collection": {
            "enabled": false
          },
          "recovered_from": null,
          "saved_payment_method_options": null,
          "setup_intent": null,
          "shipping_address_collection": null,
          "shipping_cost": null,
          "shipping_details": null,
          "shipping_options": [],
          "status": "open",
          "submit_type": null,
          "subscription": null,
          "success_url": "http://test.host/checkout/success",
          "total_details": {
            "amount_discount": 0,
            "amount_shipping": 0,
            "amount_tax": 0
          },
          "ui_mode": "hosted",
          "url": "https://checkout.stripe.com/c/pay/cs_test_b1OPNanJI2RTnd9YMTw6nhN0LxN7YpY05zMFuiMx6s9rzNMjaUuBYBmmal#fidkdWxOYHwnPyd1blpxYHZxWjA0VGwxYGRNd2sxNWhnRGhyV0tkT2tcVTZ9UF9hTExSSzwzZm9vMzVkdV81PVByN21tQFx1QDF2c2pSMXRuNUlDVW1sQUdxT1BjajQ3VHVyYWJJUlJySWt2NTVEd3Ixf3BocCcpJ2N3amhWYHdzYHcnP3F3cGApJ2lkfGpwcVF8dWAnPydocGlxbFpscWBoJyknYGtkZ2lgVWlkZmBtamlhYHd2Jz9xd3BgeCUl"
        }
  recorded_at: Sun, 26 Jan 2025 16:17:35 GMT
recorded_with: VCR 6.3.1
